import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex);

export default new Vuex.Store({
    state: {
        posts: [ {
			id: 0,
			theme: "Новое объявление",
			post: "Сюда можно нажать",
			number: "phone",
			enail: "email"
		  },
		  {
			id: 1,
			theme: "Другое объявление",
			post: "Если текст очень длинный, его можно прокрутить \n текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст ",
			number: "phone",
			enail: "email"
		  },
		  
		],
    }
})

